IDEA Open Model
ReinfType Enumeration
Compatible with IDEA StatiCa v 10.1
 Type of reinforcement
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public enum ReinfType
Public Enumeration ReinfType
public enum class ReinfType
Members
Member name | Value | Description
Bars | 0 |  Bars
DecoiledRods | 1 |  Decoiled rods
WireFabrics | 2 |  Wire fabrics
LatticeGirders | 3 |  Lattice girders
See Also
Reference
IdeaRS.OpenModel.Material Namespace